import 'package:festival_app/headers.dart';

List<Map<String, dynamic>> allQuoteData = [
  //મકરસંક્રાંતિ

  {
    "quote": [
      "નીલ ગગનનો ઉજાસ, મળે ખુશિનો આભાસ, મકર સંક્રાંતિની શુભકામના!",
      "ઉતરાયણ નો પર્વ, ખુશિનો સમાવશો, આનંદનો ઉત્સવ મનાવશો.",
      " મકર સંક્રાંતિ ની શુભકામના, ખુશિનો આનંદ લઈને આવે તમારા ઘર.",
      "મકર સંક્રાંતિનો પર્વ, ખુશિની બારાત, ખુશીની પરાત.",
      "ઉતરાયણ નો ઉજાસ, મકર સંક્રાંતિની આનંદની બારાત.",
      " મકર સંક્રાંતિ ની ખુશી, ખેતરમાં મળે શુભક્ષણ.",
      "ઉતરાયણ નો ઉજાસ, ખુશિની ધાર, મકર સંક્રાંતિની શુભ સાતની શાન.",
      " મકર સંક્રાંતિની શુભકામના, મળે આપને આનંદ અને સુખ.",
      "ઉતરાયણ નો પર્વ, ખુશિની બારાત, મકર સંક્રાંતિની શુભ પરાત.",
      "મકર સંક્રાંતિની ખુશી, આનંદ અને ઉત્સાહ સાથે આવે તમારા જીવનમાં.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "મકરસંક્રાંતિ",
    "img":
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTpmDlO4SwMORpFJgCXAMtGPr-HYI27Vq-pPw0TMr05Gw&s",
    "images": [
      "https://www.shutterstock.com/image-illustration/happy-makar-sankranti-festival-greeting-260nw-2104312412.jpg",
      "https://www.shutterstock.com/image-vector/happy-makar-sankranti-holiday-background-260nw-770589919.jpg",
      "https://www.shutterstock.com/image-vector/happy-makar-sankranti-holiday-background-260nw-774713716.jpg",
      "https://www.shutterstock.com/image-vector/pennants-frame-background-260nw-1200785050.jpg",
      "https://png.pngtree.com/png-clipart/20210309/original/pngtree-makar-sankranti-cute-frame-illustration-with-kits-or-sweets-png-image_5860256.png",
    ],
  },

  //ગણતંત્ર દિવસ

  {
    "quote": [
      "ભારતની મહાન રિપબ્લિક ડે ની હાર્દિક શુભ્કામના!",
      "ભારતનો ગર્વ, ભારતનો સમ્માન, ભારતનો પ્રેમ, હવે અમર સંવિધાન.",
      " ભારતીય સંવિધાન એ આપણે મારા હકો ની માન્યતા આપે છે.",
      "સંવિધાન નો આદર, સ્વાધીનતાનો ઉત્સવ, ભારત ની મહિમા નો અભિનંદન.",
      "ભારતનો પ્રતિષ્ઠાન અને સમૃદ્ધિ નો અભિનંદન કરેછે.",
      "ભારતીય સંવિધાન એ આપણે વિવેક, સમાનતા અને એકતા ની મૂર્તિ આપે છે.",
      "ભારત એક મહાન રિપબ્લિક આપણે ગૌરવિત કરી રહ્યા છીએ.",
      "આવો કરીએ ભારતીય સંવિધાન નો ગૌરવ કરીએ.",
      "ભારતનો ગર્વ, ભારતની આન એક ભાષા, એક સંસ્કૃતિ, એક વિચાર.",
      "ભારતીય સંવિધાન એ આપણે મારા હકો ની માન્યતા આપે છે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "ગણતંત્ર દિવસ",
    "img":
        "https://nationaltoday.com/wp-content/uploads/2020/08/indian-independence.jpg",
    "images": [
      "https://www.shutterstock.com/shutterstock/photos/1288261873/display_1500/stock-vector-republic-day-of-india-background-celebration-january-india-republic-day-background-with-parade-1288261873.jpg",
      "https://static.vecteezy.com/system/resources/previews/014/583/794/non_2x/india-republic-day-ashoka-wheel-26-january-indian-flag-for-website-banner-flyer-poster-background-wallpaper-vector.jpg",
      "https://m.media-amazon.com/images/I/61PPsN9YklL._AC_UF1000,1000_QL80_.jpg",
      "https://png.pngtree.com/png-clipart/20210309/original/pngtree-indian-republic-day-frame-png-image_5869721.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTahPXb9m6W9bhHzHRd9MutcynWUOLxkCCW1SA5di-QfM3eXT_z-jUH_V6N_8yf6KoQoJE&usqp=CAU",
    ],
  },

  //મહાશિવરાત્રી

  {
    "quote": [
      " મહાશિવરાત્રિ ની હાર્દિક શુભ્કામના!",
      "ભગવાન શિવ એ એક મહાન ગુરૂ છે, જે આપણે પ્રેમ, શાંતિ અને સુખ આપે છે.",
      " મહાશિવરાત્રિ ની ખુશિઓ સાથે આવે, પ્રેમ અને શાંતિનો આનંદ મળે.",
      "ભગવાન શિવની કૃપા સાથે આપણે જીવનની અનેક સમસ્યાઓનો સમાધાન પામીએ છીએ.",
      "શિવરાત્રિની સારી શુભ્કામનાઓ! શિવની કૃપા આપ પર બની રહે!",
      "મહાશિવરાત્રિ ની શુભકામના! આપણે સદાચારે આનંદની સ્થિતિમાં રહેવું.",
      "શિવરાત્રિ નો પર્વ આપને શાંતિ, આનંદ અને સુખ લવે.",
      "હર હર મહાદેવ! શિવરાત્રિની હાર્દિક શુભ્કામનાઓ!",
      "મહાદેવ કૃપા કરી આપ સુખ-શાંતિ અને આનંદ મેળવો.",
      "શિવરાત્રિ ની આનંદ અને ખુશિનો મોમેંટ્સ તમારી જીવનમાં હમેશા મધુર રહેશે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "મહાશિવરાત્રી",
    "img": "https://media.seniority.in/wysiwyg/shutterstock_1181604850.jpg",
    "images": [
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLjK9HL1RxlH374G_c1kXNGD_Pfl_ju92PswNbhpOE6odk2klHL13K7PdNbfuAjLC47e4&usqp=CAU",
      "https://i.pinimg.com/736x/08/00/31/080031e4257aa7f189b8c94029706baa.jpg",
      "https://png.pngtree.com/png-vector/20210311/ourmid/pngtree-happy-maha-shivratri-frame-illustrration-design-png-image_3044487.png",
      "https://png.pngtree.com/png-clipart/20220228/original/pngtree-maha-shivaratri-trisul-frame-with-brush-stroke-border-png-image_7325924.png",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTp4OOxlWYwYG9CqDe6pHE8RS8osJbqaBuPZF_lT4JCYBGoDbNtN_6Pt3sSNC6Ji7nNXXI&usqp=CAU",
    ],
  },

  //હોળી

  {
    "quote": [
      "હોળીની ખુશિઓ અને રંગો સાથે આવે, આનંદનો ત્યોહાર મનાવો!",
      "રંગો ની હોળી, ખુશીનો ઉત્સવ, સૌને મળે આનંદની ભરપૂર વાતો!",
      "હોળીની ખુશિઓ, રંગો નો ત્યોહાર, પ્રેમ અને આનંદની બારાત મનાવો!",
      "હોળીની પાવન રાત્રે, આનંદ અને પ્રેમની ધારા છેડવીએ!",
      "રંગ ની ખેલો, મિત્રો ને અને પરિવારને ખુશ રાખો!",
      "હોળીના ત્યોહારે, ખુશિઓ નો રંગ આપજો આપણા જીવને!",
      "હોળીની રંગતળા, પ્રેમ અને આનંદની મિઠાસ બઢાવો!",
      "હોળી નો રંગ, આનંદની ફૂલ બારાત, પ્રેમ અને મિત્રતાનો ત્યોહાર!",
      "હોળીના રંગોમાં, સૌને મળે ખુશિની મિઠાસ!",
      "રંગો નો ત્યોહાર, આનંદ અને ખુશિનો મોમેન્ટ્સ તમારા જીવનમાં હમેશા મધુર રહેશે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "હોળી",
    "img":
        "https://images.news18.com/ibnlive/uploads/2023/03/happy-holi-2023-images-and-wishes-4.jpg?im=FitAndFill=(1200,675)",
    "images": [
      "https://png.pngtree.com/png-clipart/20220314/original/pngtree-happy-holi-twibbon-frame-for-facebook-instagram-png-image_7446953.png",
      "https://png.pngtree.com/png-clipart/20220307/original/pngtree-indian-holi-festival-transparent-border-frame-png-image_7425154.png",
      "https://www.shutterstock.com/shutterstock/photos/1028943310/display_1500/stock-vector-happy-holi-banner-border-frame-card-indian-festival-concept-watercolor-painting-vector-hand-1028943310.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSoX09N2yOrTM1tkT47FQDVFnmGHwHfdx3xn3VXc7LPvrmvWrTXTVySQtJaagnD4RF6nfY&usqp=CAU",
      "https://i2.wp.com/files.123freevectors.com/wp-content/original/509317-holi-colorful-splash-banner-image.jpg?w=420",
    ],
  },

  //મહાવીર જયંતિ

  {
    "quote": [
      "મહાવીર જયંતી ની હાર્દિક શુભેચ્છા! અહીં છે જીવનની માર્ગદર્શિકા મહાવીર સ્વામીના અવિચળ માર્ગોને આપેલા.",
      "પ્રેમ, શાંતિ, અને અહિંસાના આદર્શ અને મહાવીર સ્વામીના સંદેશ આપવાની યોગ્યતા છે.",
      "જ્ઞાન, અહિંસા, અને સદાચારની અનુસરણકર્તાની જીવનની મહાવીર સ્વામી દિશા.",
      "મહાવીર સ્વામીની જયંતી પર, આપણે જીવનની સત્ય અને સાધનાની મૂર્તિ સ્વીકારીએ.",
      "મહાવીર જયંતી ની શુભેચ્છા! પ્રેમ, અહિંસા અને સત્યને સાધ્ય કરવાની ક્ષમતા આપતા.",
      "જય જિનેન્દ્ર! જય મહાવીર! તેમનો સંદેશ સત્ય, અહિંસા અને પ્રેમ છે.",
      "મહાવીર સ્વામીની જયંતીની શુભેચ્છા! તેમની અહિંસા અને સત્યની પાલન કરી રહીએ.",
      "મહાવીર સ્વામી એ આપણા અંતરાત્માની જ્યોતિ છે, જે આપણે પ્રેમ અને પરમ સત્ય સાથે પરિચય કરવા માટે પ્રેરિત કરે છે.",
      "મહાવીર સ્વામીની આસરા તલે પ્રેમ, સંતોષ અને પ્રગટ થાય છે.",
      "જય મહાવીર! તે આપણે અહિંસાની માર્ગ દર્શાવે છે અને પ્રેમની માર્ગદર્શિકા આપે છે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "મહાવીર જયંતિ",
    "img":
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQI-4j__UTQebD1ZGi0sFLaOaFmatgvor0EQ7SN2vb-6g&s",
    "images": [
      "https://mir-s3-cdn-cf.behance.net/projects/404/0faf5694926135.Y3JvcCw5OTksNzgyLDAsOQ.png",
      "https://img.freepik.com/premium-vector/illustration-mahavir-jayanti-celebration-background-april-6-black-white-illustration_652994-1234.jpg",
      "https://media.istockphoto.com/id/1477761844/es/vector/dibujo-de-l%C3%ADneas-vectoriales-de-mahavir-jayanti.jpg?s=1024x1024&w=is&k=20&c=75F6O42KP38buVGPFBwMnJiYEAvRLK75R6tDrNoYR6E=",
      "https://www.shutterstock.com/image-vector/illustration-mahavir-jayanti-celebration-background-260nw-1651764619.jpg",
      "https://us.123rf.com/450wm/f1digitals/f1digitals2204/f1digitals220400287/186061620-happy-mahavir-jayanti-graphic-banner-template-in-simple-and-modern-illustrative-style.jpg",
    ],
  },

  // હનુમાન જયંતિ

  {
    "quote": [
      "જય બજરંગ બલી! તેનો જયંતી પર, હર બુરાઈને હારાણી શક્તિ આપવો.",
      "હનુમાન જયંતી ની શુભકામના! જેનો નામ સદા અમર રહે.",
      "પ્રભુ શ્રી રામના ભક્ત હનુમાનજીની જયંતી ની હાર્દિક શુભેચ્છા!",
      "હનુમાન જયંતી ની ખુશીની આનંદો સાથે ભરાયો હોવો.",
      "જય બજરંગબલી! તેની શક્તિ અમર રહે.",
      "હનુમાનજીની આશીર્વાદની આનંદની પ્રવાહ છે.",
      "હનુમાન જયંતી ની શુભેચ્છા! તેની કૃપા આપ પર બની રહે.",
      "જય બજરંગ બલી! તે તમને સદા રક્ષણ અને સમૃદ્ધિ આપે.",
      "હનુમાનજીની ભક્તિની વાત જ અલગ છે, જેનાથી દુઃખની પ્રતિસ્થા થાય છે.",
      "જય હનુમાન! આપણા જીવનમાં પ્રેમ, શાંતિ અને સમૃદ્ધિ લવાની શક્તિ આપો.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "હનુમાન જયંતિ",
    "img":
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQcaLVZzdFXCz3fuyPBL_oodYeLLw4YIzDMuA&s",
    "images": [
      "https://5.imimg.com/data5/SELLER/Default/2020/8/CG/JE/OM/98055117/61yr9tjdcal-sl1100--500x500.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ6tI4dtIS2Hkw2rW1UBaIUeb0xAH8JApVBuy56zVilDdA1xvHsnDuYYTDjDnZXud3P3bo&usqp=CAU",
      "https://i.pinimg.com/736x/91/94/2b/91942bf6a52fc0b935de517435decd3e.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRow3afOpT8gxl6jsV18AEjIBBWUIUAvZUiBY167kGfDP12LHEJ1UrDL-IK3CJ8-bN85NM&usqp=CAU",
      "https://static.displate.com/270x380/displate/2020-04-07/6a1ce1fef33d5da2b641be661c9cca2d_ce2619ef8813bd5d3ee119774a9d0823.jpg",
    ],
  },

  //રક્ષાબંધન

  {
    "quote": [
      "રક્ષાબંધન ની આનંદો અને ખુશિનો મોમેન્ટ્સ તમારી જીવનમાં હમેશા મધુર રહેશે.",
      "રક્ષાબંધન એ ભાઈ-બહેનની નજીકનું બંધન અને પ્રેમનો દિવસ છે.",
      "ભાઈ બનાવે હંમેશા તમારા સાથે હોય તેમની મોટી મહેનત અને પ્રેમ નું તોહફો.",
      "રક્ષાબંધન ની મીઠી યાદો અને મોમેન્ટ્સ તમારા જીવનના આધાર છે.",
      "રક્ષાબંધન ની સૌને માટે હંમેશા ખુશિની બહાર અને ઉત્સાહ લાવે.",
      "ભાઈ ની રક્ષા કરવા તે બહેન જ છે, જે મોટા હોય તેમની આધારશીલતા અને સામર્થ્યનું પ્રદર્શન છે.",
      "રક્ષાબંધન એ આપણા સંબંધોનું મજબૂતીકરણ અને આદર્શ છે.",
      "રક્ષાબંધન નો પર્વ આપણે એકદાયક સાથે મળ્યો પ્રેમ અને સંબંધનું પ્રતિષ્ઠાન કરે છે.",
      "રક્ષાબંધન નો દિવસ આપણા જીવનમાં ખુશિ અને ઉત્સાહ લાવે છે.",
      "રક્ષાબંધન ની શુભેચ્છા! હંમેશા આપણા સંબંધોનો સાથે જુદો રહેવું અને પ્રેમ અને આદર આપવું.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "રક્ષાબંધન",
    "img":
        "https://c.tadst.com/gfx/750w/kid-in-festive-clothing-feeding-sweets-to-sibling.jpg",
    "images": [
      "https://png.pngtree.com/png-vector/20210720/ourmid/pngtree-raksha-bandhan-banner-design-graphic-vector-png-png-image_3605150.jpg",
      "https://png.pngtree.com/png-clipart/20210808/original/pngtree-happy-raksha-bandhan-frame-design-template-vector-png-image_6615224.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQo-4dIQ0XSb32LzbsIAxtzvsLhIU2RNJG0WCRd8hc1A&s",
      "https://png.pngtree.com/png-vector/20210720/ourlarge/pngtree-raksha-bandhan-twibbon-profile-frame-design-png-png-image_3605145.jpg",
      "https://i.pinimg.com/474x/ed/8f/f7/ed8ff7fed708c278331c792e468c811b.jpg",
    ],
  },

  // સ્વતંત્રતા દિવસ

  {
    "quote": [
      "આપણે સ્વાતંત્ર્ય અને સ્વાભિમાનથી આવાજ ઉઠાવીએ, કે આપણે સ્વતંત્ર અને સમર્થ છીએ.",
      "આપણે હમેશાં આજાદીની મુકામ પર અગ્રસર છીએ, અને આપણે સ્વાતંત્ર્યનો મહિમાન મનાવીએ.",
      "સ્વાતંત્ર્ય નો મોમેન્ટ આપણને હમેશાં યાદ રહેશે, અને આપણે આજાદીનો ગૌરવ મનાવીએ.",
      "આપણે સ્વાતંત્ર્ય ને સમર્પિત થઇ રહ્યા છીએ, અને આપણે આજાદીની પ્રાપ્તિ માટે હંમેશાં તૈયાર છીએ.",
      "આજ સ્વતંત્રતા ની જયંતિ હોવી છે, અને આપણે આજાદીની મહિમા મનાવીએ.",
      "સ્વાતંત્ર્ય એ સ્વાભિમાન અને સમર્થતાની સાકારાત્મક સંવેદના છે.",
      "સ્વતંત્રતા ની મહિમા અને મૂળ્યો માટે જોરદાર હાથ જોડો.",
      "સ્વાતંત્ર્ય એ આપણા જીવનનું મહત્વનો દિવસ છે, જેની યાદ હંમેશાં રહેશે.",
      "આજાદી એ આપણા હકનો પ્રતિનિધિત્વ છે, અને આપણે તેની રક્ષા કરવા જોરદાર છીએ.",
      "સ્વતંત્રતા નો મહિમા સ્વીકારો, અને આપણે એક સુખી અને આજાદ જીવન બનાવીએ.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "સ્વતંત્રતા દિવસ",
    "img":
        "https://nationaltoday.com/wp-content/uploads/2020/08/indian-independence.jpg",
    "images": [
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSa3EJNMyxZH6lirlCWLZD9IlX7TbK6Z-s-U-NeiDqAYw&s",
      "https://trbahadurpur.com/wp-content/uploads/2022/08/independence-day-photo-frame-new-1.png",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQebyDF0WZ_iLXEMLxHr79BOBOCg365VNd3jRvu0rwmhg&s",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRoSuq-w6ABrel9ACvYPWNXgH3wX0mvVcQ4q72rDl93tg&s",
      "https://img.freepik.com/premium-vector/india-blank-frame-card-independence-day_76844-924.jpg",
    ],
  },

  //જન્માષ્ટમી

  {
    "quote": [
      "જન્માષ્ટમી ની આપણી હરીની પ્રતીક્ષા રહી છે, અને તે આગામી જ સમયમાં આવશે.",
      "શ્રી કૃષ્ણ ની કૃપા અને આશીર્વાદ તમારે હંમેશાં સાથે રહેશે.",
      "શ્રી કૃષ્ણ ની પ્રેમ અને આનંદની આનંદો તમારે પ્રાપ્ત થઈ જશે.",
      "જન્માષ્ટમી એ ભગવાન કૃષ્ણનો આગમન અને પ્રેમનો ઉત્સવ છે.",
      "શ્રી કૃષ્ણ ની આનંદો અને પ્રેમની મહિમા મનાવો.",
      "જન્માષ્ટમી નો પર્વ આપણને આશા અને આનંદનું સંદેશ આપે છે.",
      "શ્રી કૃષ્ણ ની કૃપા તમારે સદા સાથે હોવી.",
      "જન્માષ્ટમી નો પર્વ સંતોષ અને આનંદની ઉજાસ પ્રદર્શન કરે છે.",
      "શ્રી કૃષ્ણ ની આરાધના કરો, અને તેની કૃપા અને આશીર્વાદ પ્રાપ્ત કરો.",
      "જન્માષ્ટમી ની શુભકામનાઓ! શ્રી કૃષ્ણ તમારી જીવનમાં પ્રેમ, શાંતિ, અને સુખની મહિમા લવાવો જેવું છે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "જન્માષ્ટમી",
    "img":
        "https://www.livemint.com/lm-img/img/2023/09/06/900x1600/DH_PTII_1693995537238_1693995565790.JPG",
    "images": [
      "https://png.pngtree.com/png-clipart/20220718/ourmid/pngtree-krishna-janmashtami-frame-design-png-png-image_6005913.png",
      "https://png.pngtree.com/png-clipart/20210725/original/pngtree-krishna-janmashtami-banner-border-design-png-vector-png-image_6570875.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTzfvHcQcXhTy_j1b53hWZozl7x7o7pGcFCUrjNq1NkrQ&s",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxxwd2E1kCSiG82-ev3UJFNA_jSm9bUlUtCDJJbg5AdTjfy4a-m4fNaWtTmafYu7RySwY&usqp=CAU",
      "https://static.vecteezy.com/system/resources/thumbnails/002/491/922/small/janmashtami-background-template-free-vector.jpg",
    ],
  },

  //ગણેશ ચતુર્થી

  {
    "quote": [
      "ગણેશ ચતુર્થી ની હાર્દિક શુભકામનાઓ! ગણપતિ બપ્પા મોરિયા!",
      "ગણેશ ચતુર્થી પર, ગણપતિની આશીર્વાદ અને આનંદ તમારે સદા મળે.",
      "ગણેશ ચતુર્થી એ આનંદનું પર્વ છે, જે હર વિઘ્ન અને બાધાને દૂર કરે.",
      "મહા ગણપતિ એ આપણા જીવનમાં ખુશિ અને સુખની મહિમા લવાવી છે.",
      "ગણેશ ચતુર્થી ની શુભકામનાઓ! જય ગણેશ!",
      "ગણેશ બપ્પા મોરિયા! તમારી કૃપા અને આશીર્વાદ સદા અમારી સાથે હોવું.",
      "મહા ગણપતિ એ આપણા જીવનની સર્વોત્તમ મોર્ચા છે.",
      "ગણેશ ચતુર્થી ની શુભકામનાઓ! આપને સદા સુખ, સમૃદ્ધિ અને આનંદ મળે.",
      "ગણેશ બપ્પા મોરિયા! તમારી કૃપા અને આશીર્વાદ સદા અમારી સાથે રહે.",
      "જય ગણેશ! તમારી મહિમા અમૃત અને અમર છે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "ગણેશ ચતુર્થી",
    "img":
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5jJQyZHkvntHAhnF-cOLMWN4jI1zQpzTllpid4pBgXw&s",
    "images": [
      "https://png.pngtree.com/png-vector/20220821/ourmid/pngtree-ganapati-clipart-ganesh-chaturthi-frame-border-png-image_6118060.png",
      "https://i.pinimg.com/236x/e1/9e/45/e19e4505bed95726c95eb1462edd9b91.jpg",
      "https://i.pinimg.com/736x/12/66/da/1266da4857e5d7c1d8d3bc43fb983f54.jpg",
      "https://png.pngtree.com/png-vector/20210903/ourlarge/pngtree-happy-ganesh-chaturthi-frame-png-image_3843254.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTi6xzr1pvbcPxcLdddgpoot_oTpR32X9xAazPuC3q5l5cnC4fTlQdb87L6EFf5fBKl0Xg&usqp=CAU",
    ],
  },

  //નવરાત્રી

  {
    "quote": [
      "નવરાત્રી ની આવ્યાશે, ખુશિનો ઉત્સવ આવ્યાશે!",
      "નવરાત્રી ની શુભકામનાઓ! માંગો માં ભગવાનની કૃપા અને આશીર્વાદ.",
      "જય માં અંબે! નવરાત્રી ની શુભેચ્છાઓ!",
      "નવરાત્રી એ પરંપરાનું ઉત્સવ છે, જેનો આનંદ અને ખુશિનો વિશેષ સમય છે.",
      "જય માતાજી! નવરાત્રી ની આનંદની પરંપરા છે.",
      "નવરાત્રી એ આત્માને શુદ્ધ અને શાંતિની સ્થિતિમાં લઈ જવાનું મહત્વનું ઉત્સવ છે.",
      "માં દુર્ગાની આશીર્વાદ તમારી જીવનમાં ખુશિ અને સુખનો આવાજ હોવો.",
      "નવરાત્રી એ સમય છે જેનો ઉપયોગ આત્માની પરિષ્કૃતિ માટે કરવામાં આવે છે.",
      "જય માં શેરાવાળી! નવરાત્રી ની ખુશીની આનંદો સાથે ભરાયો હોવો.",
      "નવરાત્રી ની શુભકામનાઓ! માં આપને સદાકે ખુશ અને સમૃદ્ધ રાખે.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "નવરાત્રી",
    "img":
        "https://www.thefestivalwishes.com/pixlab/uploads/sample_uploads/1697203245_write-name-on-happy-navratri-wishes-for-whatsapp-download.jpg",
    "images": [
      "https://i.pinimg.com/736x/82/e3/21/82e3218c1f4ddf87743a2b27ef7f6cd3.jpg",
      "https://png.pngtree.com/png-vector/20211006/ourmid/pngtree-happy-navratri-png-festival-india-png-image_3971608.png",
      "https://png.pngtree.com/png-vector/20220923/ourmid/pngtree-twibbon-of-navratri-indian-festival-luxury-with-durga-maa-face-vector-png-image_6212703.png",
      "https://static.vecteezy.com/system/resources/previews/011/841/895/non_2x/happy-navratri-indian-festival-celebration-background-free-png.png",
      "https://png.pngtree.com/png-clipart/20220914/original/pngtree-happy-navratri-and-dandiya-sticks-frame-png-image_8617796.png",
    ],
  },

  //દુર્ગા

  {
    "quote": [
      "દુર્ગા પૂજા ની શુભકામનાઓ! માં તમારી સારી પૂરી કરે.",
      "માં આપને શક્તિ અને સામર્થ્ય આપે એવી પ્રાર્થના કરું છું.",
      "જય માં દુર્ગા! તમારી કૃપા અને આશીર્વાદ સદા અમારી સાથે હોવો.",
      "દુર્ગા પૂજા એ શાંતિ અને સુખનો પ્રતિષ્ઠાન કરવાનો ઉત્સવ છે.",
      "દુર્ગા પૂજા ની શુભકામનાઓ! તમારી જિંદગીમાં ખુશી અને સમૃદ્ધિ લાવો.",
      "માં આપને શક્તિ અને સામર્થ્ય આપે, અને આપની પ્રાર્થનાઓને સાકાર કરે.",
      "જય માં દુર્ગા! તમારી આનંદની પ્રાપ્તિ થવા માટે આવતા ઉત્સવનો સમય છે.",
      "દુર્ગા પૂજા ની ખુબ ખુબ શુભેચ્છાઓ! માં તમારી સારી પૂરી કરે.",
      "માં તમારી આશીર્વાદની આપણી મહત્વની શક્તિ અને સામર્થ્ય સાથે હોવું.",
      "જય માં દુર્ગા! તમારી કૃપા અને આશીર્વાદ સદા અમારી સાથે હોવો.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "દુર્ગા",
    "img":
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTc029n5u97aviQl0kfUY6HEiRQW7tttchoWiQvsHVRsza8BZr5hu4W49D4bfFvkmefyNs&usqp=CAU",
    "images": [
      "https://static.vecteezy.com/system/resources/previews/027/950/520/non_2x/hindu-festival-durga-puja-border-decorations-durga-puja-frame-durga-puja-background-free-vector.jpg",
      "https://i.pinimg.com/236x/d5/2c/9f/d52c9fc8eee1294ddf2c0cbc16050769.jpg",
      "https://i.pinimg.com/564x/99/98/4f/99984f7e21153e684a58458e53b75402.jpg",
      "https://c8.alamy.com/comp/W373HP/decorative-mandalas-hanging-ethnic-boho-style-W373HP.jpg",
      "https://i.pinimg.com/474x/3e/fe/28/3efe286eaad53e73fc9e8d93abdece98.jpg",
    ],
  },

  //દશેરા

  {
    "quote": [
      "આપને દશેરા પર્વ ની શુભ્કામનાઓ! આનંદ અને ઉલ્લાસનું ઉત્સવ મનાઓ.",
      "જે વ્યક્તિ અહંકાર અને દુષ્ટતાને જીતે છે, તે જયારે દશેરા પર્વ મનાવે છે.",
      "આજ દશેરા પર્વ ને સમર્પિત કરો અને આનંદનું સંતોષ અને ઉત્સાહ મનાઓ.",
      "દશેરા ની શુભ્કામનાઓ! આપની જિંદગીમાં આનંદનો પ્રકાશ માનો.",
      "આજ દશેરા પર્વ એ જય જયકાર અને ઉત્સવનું દિવસ છે.",
      "દશેરા ની હર્દિક શુભ્કામનાઓ! શક્તિ અને સમર્પણનું પર્વ.",
      "જો આપ પ્રેમ, શાંતિ અને સમર્પણની ઊંચાઇયો પર સ્થાન કરો, તો દશેરા પર્વ આપને શુભ્કામનાઓ આપશે.",
      "દશેરા ની હર્દિક શુભ્કામનાઓ! શાંતિ અને સુખ તમારી જીવનમાં હાજર રહે.",
      "દશેરા પર્વ ને ઉજવવાથી આપને પ્રેમ અને ખુશિ મળે.",
      "આજ દશેરા પર્વ એ સમર્પિત કરો અને આપની જીવનમાં આનંદની ઊંચાઇ પ્રાપ્ત કરો.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "દશેરા",
    "img": "https://imgk.timesnownews.com/story/cold_smooth_tasty._3_0.png",
    "images": [
      "https://media.istockphoto.com/id/1172210190/vector/happy-dussehra-festival-poster-design.jpg?s=612x612&w=0&k=20&c=ue6TwRLnNMWFESCfhQ_cAZ5PxdRgW6HFBDJjBNPBbQ0=",
      "https://img.freepik.com/free-vector/elegant-happy-dussehra-festival-cultural-background-with-frame-vector_1055-9152.jpg",
      "https://i.pinimg.com/736x/e1/e1/ce/e1e1ce0d12878e14e4627d5255a26d5c.jpg",
      "https://png.pngtree.com/png-vector/20220914/ourlarge/pngtree-dussehra-festival-greeting-or-poster-design-ramayana-editable-poster-vector-png-image_25399044.jpg",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQpIcQJ0bm8UWtbkKYxUxV8x86ZQRm32ErZwnf6G9NnY0tdsN4KIOo81SqY9t4CZ3MvE_E&usqp=CAU",
    ],
  },

  // દિવાળી

  {
    "quote": [
      "દિવાળી ની શુભકામનાઓ! પ્રેમ, શાંતિ અને સમૃદ્ધિનો તરફદાર થાઓ.",
      "દિવાળી ની હરશ અને ઉજાસ આપની જિંદગીમાં સદા પ્રકાશમય રહે.",
      "દિવાળી એ ઉજાસનો પર્વ છે, જે આપની જિંદગીમાં નવો ઉજાસ લાવે.",
      "દિવાળી ની શુભકામનાઓ! આપની જીવનમાં આનંદનો ઉજાસ માનો.",
      "આપનું દિવાળી ધર્મ, શાંતિ અને સમૃદ્ધિની આવરણ છે.",
      "દિવાળી પર્વ સદાકે ખુશી અને ઉજાસનું પ્રકાશ લાવે.",
      "દિવાળી ની શુભ કામનાઓ! આપની જીવનમાં પ્રેમ અને આનંદ વધારો.",
      "દિવાળી એ શુભરાત્રિ છે, જે પ્રેમ અને ખુશિની ઊંચાઇ લાવે.",
      "દિવાળી ની શુભ કામનાઓ! પ્રેમ અને આનંદનો તરફદાર થાઓ.",
      "આપનું દિવાળી ખુશિ, શાંતિ અને સમૃદ્ધિ સાથે ભરો.",
    ],
    "author": "Jenuuu..🫀🧠👀",
    "category": "દિવાળી",
    "img":
        "https://i.pinimg.com/736x/2a/05/d6/2a05d6338bf60f2b5a389dec4d8d7e22.jpg",
    "images": [
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT05riwlbJWZ51IaM4n-l5Jh-6o3RmZ-W6-KGr3Y0mWTQ&s",
      "https://img.freepik.com/free-vector/happy-diwali-traditional-white-decorative-background_1017-34303.jpg?size=338&ext=jpg&ga=GA1.1.1930204137.1712016000&semt=sph",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS4RlX82jMWfkrHL_V6kIa1kiqZ0esVtIDXrYDgY7U9E5o_5OzVh_JGq79P0weqaiYa0go&usqp=CAU",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTiQw6v-Ra9JnyFR5HlvCpUWjHhtqyawVxgYNW9Ut0Ojw&s",
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQkpDc4YqqnIoxWHeC7qTASumPAxAc-bg4f1HBRExT1ew&s",
    ],
  },
];

List<String> upcomingImage = [
  "https://images.indianexpress.com/2021/04/Hanuman-Jayanti-2-2.jpg",
  "https://www.hindustantimes.com/ht-img/img/2023/08/29/1600x900/Happy_Raksha_Bandhan_2023_1693281270411_1693281270588.jpg",
  "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNwZLrPMIiYWdfgzc-2mAm8FBsksk-36VvdrvbeZO6ww&s",
  "https://media.istockphoto.com/id/1178112027/photo/ganesh-festival.jpg?s=612x612&w=0&k=20&c=Ygxq3nwldjAflfi27ctw9K7Zfgalh9Znedex-hfWjAQ=",
  "https://static.toiimg.com/thumb/msid-94423250,width-1280,height-720,resizemode-4/94423250.jpg",
  "https://static.toiimg.com/thumb/msid-94636466,width-1280,height-720,resizemode-4/94636466.jpg",
  "https://img.freepik.com/free-vector/gradient-background-diwali-festival-celebration_52683-142488.jpg",
];

List<Quote> allQuotes =
    allQuoteData.map((e) => Quote.fromMap(data: e)).toList();

List<String> allCategories = allQuotes
    .map(
      (e) => e.category,
    )
    .toSet()
    .toList();
